Repository: maryamqays/lms
Catalog: Resources/Views/Home/Index.*.resx
Languages: ar_sa

source: All Categories
ar_sa: جميع الفئات

source: All Courses
ar_sa: جميع الكورسات

source: Browse courses from our expert contributors.
ar_sa: تصفح الدورات من المساهمين الخبراء لدينا.

source: Career
ar_sa: حياتك المهنية

source: corresponds to &quot;Five-star course reviews.
ar_sa: مراجعات الدورات ذات الخمس نجوم

source: Courses
ar_sa: كورسات

source: DR SAIF
ar_sa: دكتور سيف

source: Drive your
ar_sa: قيادة

source: Expert instruction
ar_sa: معلمين مع خبرة

source: Explore a variety of fresh topics
ar_sa: اكتشف مجموعة متنوعة من الموضوعات الجديدة

source: Find Courses
ar_sa: البحث عن الدورات

source: Find the right instructor for you
ar_sa: ابحث عن المدرب المناسب لك

source: Five-star course reviews
ar_sa: مراجعات الدورات ذات الخمس نجوم

source: Free online courses from the world’s leading experts
ar_sa: دورات مجانية عبر الإنترنت من كبار الخبراء في العالم

source: How it works?
ar_sa: ألية العمل

source: It is no exaggeration to say this Educrat experience was transformative–both professionally and personally. This workshop will long remain a high point of my life.
ar_sa: "لا مبالغة في القول عندما أقول إن تجربة Educrat كانت تحوّلية - سواء من الناحية المهنية أو الشخصية. ستبقى هذه الورشة ذكرى جميلة في حياتي لفترة طويلة."

source: Join
ar_sa: انضم الى

source: Join For Free
ar_sa: انضم مجانا

source: Learn on your schedule
ar_sa: تعلم على الجدول الزمني الخاص بك

source: learners today
ar_sa: متعلم اليوم

source: Lifetime access
ar_sa: وصول مدى الحياة

source: Master the Skills to
ar_sa: اتقن المهارات ل

source: Online courses
ar_sa: دروس مباشرة على الإنترنت

source: Product Manager, Apple Inc
ar_sa: مدير المنتجات، شركة أبل

source: Purchase quickly and securely.
ar_sa: الشراء بسرعة وأمان.

source: Recent Courses
ar_sa: اخر الكورسات

source: School Achievements
ar_sa: إنجازات المدرسة

source: Students community
ar_sa: مجتمع الطلاب

source: Students worldwide
ar_sa: طلاب من جميع أنحاء العالم

source: Testimonials
ar_sa: الشهادات

source: That’s it! Start learning right away.
ar_sa: هذا كل شيء! ابدأ التعلم على الفور.

source: Top Categories
ar_sa: اهم الفئات

source: Top courses
ar_sa: اهم الكورسات

source: Total course views
ar_sa: إجمالي مشاهدات الدورات

source: unique online course list designs
ar_sa: تصميمات فريدة لقائمة الدورات التدريبية عبر الإنترنت

source: Welcome
ar_sa: اهلا

source: What will you learn
ar_sa: ما ستتعلمه
